Repository: oscarahalvorsen/masterproject
Catalog: datacollecting/MAALFRID/tmx/hvl.no.csv-nb-nn.deduped.tmx
Source language: nb
Languages: nn

source: Kandidaten kan identifisere, planlegge og gjennomføre prosjekter, eksperimenter og simuleringer, samt analysere, tolke og bruke framkomne data, både selvstendig og i team.
nn: Kandidaten kan identifisera, planleggja og gjennomføra prosjekt, eksperiment og simuleringar, samt analysera, tolka og bruke framkomne data, både sjølvstendig og i team.

source: Studiet bygger på en 3-årig branningeniørutdanning og har et omfang på 120 studiepoeng.
nn: Studiet byggjer på ei 3-årig branningeniørutdanning og har eit omfang på 120 studiepoeng.

source: Kravet er gitt i Nasjonale retningslinjer for ingeniørutdanningen og bachelorgraden må inneholde:
nn: Kravet er gitt i Nasjonale retningslinjer for ingeniørutdanninga og bachelorgraden må innehalde:

source: Kjenner til budsjettet som styringsverktøy samt kan redegjøre for hvordan budsjettprosesser organiseres og gjennomføres.
nn: Kjenner til budsjettet som styringsverktøy, samt kan gjere greie for korleis budsjettprosessar blir organisert og gjennomført.

source: For å være kvalifisert for opptak til 2-årig masterprogram som gir sidetittelen sivilingeniør, stilles det mer omfattende krav til sammensetningen av bachelorutdanningen enn kravene i rammeplanen for ingeniørutdanning.
nn: For å vere kvalifisert for opptak til 2-årig masterprogram som gir sidetittelen sivilingeniør, vert det stillt meir omfattande krav til samensettinga av bachelorutdanninga enn krava i rammeplanen for ingeniørutdanning.

source: Kandidaten har grunnleggende kunnskaper i matematikk, naturvitenskap, relevante samfunns- og økonomifag og om hvordan disse kan integreres i problemløsning innen det maskintekniske området.
nn: Kandidaten har grunnleggjande kunnskap i matematikk, naturvitskap, relevante samfunns- og økonomifag og om korleis desse kan integrerast i problemløysing innan det maskintekniske området.

source: Kan redegjøre for hvordan et lands økonomi kan påvirkes av for eksempel endringer i etterspørselen, myndighetenes politikk, internasjonale forhold eller teknologisk utvikling.
nn: Kan gjere greie for korleis økonomien i eit land blir påvirka av til dømes endringar i etterspurnad, myndighetenes politikk, internasjonale forhold eller teknologisk utvikling.

source: Har opparbeidet særskilt kompetanse innenfor valgt fordypningsprofil og gjennom bacheloroppgave, slik at kandidaten kan ivareta økonomiske og administrative oppgaver i privat og offentlig sektor, samt være i stand til å identifisere, analysere og vurdere rammer for og konsekvenser av beslutninger.
nn: Har opparbeida særskilt kompetanse innan den valde fordjupningsprofilen og bacheloroppgåve, slik at kandidaten kan ivareta økonomiske og administrative oppgåver i privat og offentleg sektor, samt vere i stand til å identifisere, analysere og vurdere rammer for og konsekvensar av vedtak.

source: − Omfattende innsikt i fagfeltet som oppgaven skrives inn i − Omfattende kunnskap om relevant tidligere nasjonal og/eller internasjonal forskning på
nn: − Omfattande innsikt i fagfeltet som oppgåva er skriven inn i − Omfattande kunnskap om relevant tidlegare nasjonal og/eller internasjonal forsking på

source: Hjelpemidler ved eksamen
nn: Hjelpemiddel ved eksamen

source: Retningslinjer for masteroppgave i grunnskolelærer-utdanningene ved HVL Studentene på masterprogrammene i grunnskolelærerutdanningen ved HVL skal i løpet av 5.
nn: Generelle retningslinjer for masteroppgåve i grunnskulelærar-utdanningane ved HVL Studentane på masterprogramma i grunnskulelærarutdanninga ved HVL skal i løpet av 5.

source: Kandidaten har kunnskap om konsekvenser av utvikling og bruk av teknologi.
nn: Kandidaten har kunnskap om konsekvensar av utvikling og bruk av teknologi.

source: har kunnskap om lovgrunnlag, herunder skolens formål, verdigrunnlag, læreplaner og rettigheter og plikter for elevene og skolen
nn: har kunnskap om lovgrunnlag, inkludert skulen sitt formål, verdigrunnlag, læreplanar og rettar og plikter for elevane og skulen

source: Søkere med høyere poengsum går foran søkere med lavere poengsum.
nn: Søkjarar med høgare poengsum går framfor søkjarar med lågare poengsum.

source: Utdanningen gir innsikt i og kunnskap om betydningen av maritim virksomhet i regionalt, nasjonalt og globalt perspektiv, og bidrar til å ivareta samspillet mellom maritim teknologi, miljø og samfunn.
nn: Utdanninga gir innsikt i og kunnskap om verdien av maritim verksemd i lokalt, nasjonalt og globalt perspektiv, og bidrar til å ivareta samspelet mellom maritim teknologi, miljø og samfunn.

source: Kan med bakgrunn i kunnskapene tilegnet i studiet og relevant forsknings- og utviklingsarbeid reflektere rundt og vurdere teoretiske, praktiske og tekniske problemstillinger knyttet til operasjon og drift av skip, og er i stand til å treffe begrunnede valg.
nn: Kan med bakgrunn i kunnskapane tileigna i studiet og relevant forskings- og utviklingsarbeid reflektera rundt og vurdera teoretiske, praktiske og tekniske problemstellingar knytt til operasjon og drift av skip, og er i stand til å gjera grunngjevne val.

source: kan bruke ulike uttrykk, former og teknikker i utøvende og skapende aktiviteter, reflektere over egen faglige utøvelse og justere denne under veiledning samt vurdere behov for HMS-tiltak
nn: kan bruke ulike uttrykk, former og teknikkar i utøvande og skapande aktivitetar, reflektere over egen faglige utøving og justere denne under rettleiing

source: kan identifisere, planlegge og gjennomføre prosjekter, eksperimenter og simuleringer, samt analysere, tolke og bruke framkomne data, både selvstendig og i team.
nn: kan identifisera, planleggja og gjennomføra prosjekt, eksperiment og simuleringar, samt analysera, tolka og nytta framkomne data, både sjølvstendig og i team.

source: Nautisk utdanning gir muligheter for utveksling til utdanningsinstitusjoner i Europa innen EU-programmene Sokrates/Erasmus og Leonardo da Vinci.
nn: Nautisk utdanning gir moglegheiter for utveksling til utdanningsinstitusjonar i Europa innan EU-programma Sokrates/Erasmus og Leonardo da Vinci.

source: Kandidaten har kunnskap om matematiske tema som er grunnleggende for teknologiske fag.
nn: har kunnskap om matematiske tema som er grunnleggjande for teknologiske fag.

source: Informasjons- og kommunikasjonsteknologi er integrert i undervisningen med Classfronter og databaserte støttesystemer som viktige verktøy i det faglige og pedagogiske arbeidet.
nn: Informasjons- og kommunikasjonsteknologi er integrert i undervisinga med Classfronter og databaserte støttesystem som viktige verkty i det faglege og pedagogiske arbeidet.

source: Kan planlegge samt gjennomføre egne prosjekter.
nn: Kan planleggje samt gjennomføre eigne prosjekt.

source: Kandidaten kan gjennomføre forsøksarbeid på en kvalifisert og sikker måte, gjøre målinger, tolke resultatene og skrive rapport.
nn: Kandidaten kan gjennomføre forsøksarbeid på ein kvalifisert og sikker måte, gjere målingar, tolke resultata og skrive rapport.

source: grunnleggende matematikk, grunnleggende statistikk og samfunnsvitenskapelig metode.
nn: grunnleggjande matematikk, grunnleggjande statistikk og samfunnsvitskapleg metode.

source: Studenten vil da delta aktivt i bedriftens daglige arbeidsoppgaver, noe som vil gi verdifull og relevant praktisk erfaring fra arbeidslivet.
nn: Studenten vil då delta aktivt i bedrifta sine daglege arbeidsoppgåver, noko som vil gi verdifull og relevant praktisk erfaring.

source: Studiet skal gi kandidatene en bred kompetanseplattform for å arbeide som fagpersoner eller rådgivere innenfor det økonomiske og administrative fagfeltet i privat næringsliv, offentlig sektor og andre organisasjoner.
nn: Studiet skal gje kandidatane ei bred kompetanseplattform for å arbeide som fagperson eller rådgjevar innafor det økonomiske og administrative fagfeltet i privat næringsliv, offentlig sektor og andre organisasjoner.

source: grunnleggende bedriftsøkonomisk analyse og grunnleggende regnskap, finansregnskap, investering og finansiering og driftsregnskap med budsjettering.
nn: grunnleggjande bedriftsøkonomisk analyse og grunnleggjande rekneskap, finansrekneskap, investering og finansiering og driftsrekneskap med budsjettering.

source: I følge konfliktteori er det selve håndteringen som er avgjørende for om konflikter får positive eller negative konsekvenser.
nn: I følge konflikteori er det sjølve handteringa som er avgjerande for om konfliktar får positive eller negative konsekvensar.

source: Emnet vektlegger kunnskap om og klinisk trening i sykepleie til pasienter med medisinske sykdommer.
nn: Emnet vektlegg kunnskap om og klinisk trening i sjukepleie til pasientar med medisinske sjukdomar.

source: Kan formidle fagstoff skriftlig og muntlig og utveksle synspunkter og erfaringer, og slik sett bidra til utvikling av god praksis.
nn: Kan formidle fagstoff skriftleg og muntleg og utveksle synspunkt og erfaringar, og slik sett bidra til utvikling av god praksis.

source: Kandidaten kan løse problemer innenfor hovedområdene geometri, algebra, funksjoner, differensialligninger og sannsynlighetsregning.
nn: kan løyse problem innanfor hovudområda geometri, algebra, funksjonar, differensiallikningar og sannsynsrekning.

source: Vilkår ved avbrudd eller permisjon fra studiet:
nn: Vilkår ved avbrot eller permisjon frå studiet:

source: Det var mange som gjerne ville vere med, og vi køyrde på nytt Dialogspelet i breakoutrooms med en felles padlet der vi samla informasjon.
nn: Det var mange som gjerne ville vere med, og vi køyrde på nytt Dialogspelet i breakoutrooms med ein felles padlet der vi samla informasjon.

source: Har bred kunnskap om prosesser, verktøy og metoder tilknyttet bacheloroppgaven.
nn: Har brei kunnskap om prosessar, verktøy og metodar knytt til bacheloroppgåva.

source: Bachelorstudiet i havteknologi følger
nn: Studieprogrammet i havteknologi følgjer

source: Avtale om veiledning på bacheloroppgaven
nn: Avtale om rettleiing på bacheloroppgåva

source: grunnleggende bedriftsøkonomisk analyse og grunnleggende regnskap, finansregnskap, investering og finansiering og driftsregnskap med budsjettering, i alt 30 studiepoeng.
nn: grunnleggjande bedriftsøkonomisk analyse og grunnleggjande rekneskap, finansrekneskap, investering og finansiering og driftsrekneskap med budsjettering, i alt 30 studiepoeng.

source: UH som en lærande organisasjon
nn: UH som ein lærande organisasjon

source: Gjennom laboratoriearbeidet skal studentene bli kjent med mange ulike typer utstyr og instrumentering.
nn: Gjennom laboratoriearbeidet skal studentane bli kjent med mange ulike typar utstyr og instrumentering.

source: Kan redegjøre for hvordan virksomheter finansieres, nye investeringer vurderes samt hvordan årsregnskapet utarbeides og analyseres (bedriftsøkonomiske fag).
nn: Kan gjere greie for korleis virksomheter vert finansiert, nye investeringer vert vurdert samt korleis årsrekneskapen vert utarbeidd og analysert (bedriftsøkonomiske fag).

source: Har kunnskap om hvordan ulike faktorer og tverrfaglig samarbeid kan bidra til bedringsprosesser og et godt pasientforløp.
nn: Har kunnskap om korleis ulike faktorar og tverrfagleg samarbeid kan bidra til betringsprosessar og eit godt pasientforløp.

source: Teknologi som ikke bare brukes i Nordsjøen, men som også er viktig for oljeindustrien i andre deler av verden.
nn: Teknologi som ikkje berre vert brukt i Nordsjøen, men som òg er viktig for oljeindustrien i andre delar av verda.

source: Internasjonalt kontor informerer deg mer i forkant av testen.
nn: Internasjonalt kontor informerer deg i forkant av testen.

source: kan bidra til nytenkning, innovasjon, kvalitetsstyring og entreprenørskap ved utvikling og realisering av bærekraftige og samfunnsnyttige produkter, systemer og/eller løsninger.
nn: kan bidra til nytenking, innovasjon, kvalitetsstyring og entreprenørskap ved utvikling og realisering av berekraftige og samfunnsnyttige produkt, system og/eller løysingar.

source: Den faglige forhåndsgodkjenningen spesifiserer hva du skal gjøre mens du er på utveksling og at disse aktivitetene blir fullt ut godkjent som en del av din utdanningsplan ved HVL
nn: Den faglege førehandsgodkjenninga spesifiserer kva du skal gjere medan du er på utveksling og at desse aktivitetane vert fullt ut godkjend som ein del av din utdanningsplan ved HVL

source: Egenvurderingen skal underbygges med eksempler fra praksis.
nn: Eigenvurderinga skal underbyggjast med døme frå praksis.

source: I en kulturs materialitet og teknologi ligg difor problemstillingar både av miljømessig, historisk, estetikkfagleg og innovativ karakter.
nn: I ein kulturs materialitet og teknologi ligg difor problemstillingar både av miljømessig, historisk, estetikkfagleg og innovativ karakter.

source: For studiet gis et variert utvalg av arbeids- og undervisnings-metoder, tilpasset det enkelte emnet, begrunnet ut fra en formidling hvor den enkelte student vil bli inspirert og engasjert i emnet.
nn: For studiet gis eit variert utval av arbeids- og undervisningsmetodar, tilpassa det enkelte emnet, ut frå ei formidling der den enkelte studenten vil bli inspirert og engasjert i emnet.

source: diskutere og vurdere forskningsetiske perspektiver
nn: diskutere og vurdere forskingsetiske perspektiv

source: kan anvende kunnskap i matematikk, fysikk, kjemi og teknologiske emner for å formulere, spesifisere, planlegge og løse tekniske problemer på en velbegrunnet og systematisk måte.
nn: kan nytta kunnskap i matematikk, fysikk, kjemi og teknologiske emne for å formulera, spesifisera, planleggja og løysa tekniske problem på ein godt grunngjeven og systematisk måte.

source: kjenner til forsknings- og utviklingsarbeid innenfor fagfeltet brannsikkerhet generelt og spesielt innen eget fordypningsfag
nn: Kjenner til forskings- og utviklingsarbeidet innan fagfeltet brannsikkerheit generelt og spesielt innan eige fordjupingsfag.

source: Betydelige avvik fra planen tas opp med veileder så fort som mulig møter forberedt til veiledningstimene og holder veileder jevnlig orientert om arbeidet med masteroppgaven leverer skriftlig materiale til veileder i god tid før hver veiledningstime er ansvarlig for at nødvendige søknader vedrørende juridiske/etiske sider ved arbeidet med mastergradsoppgaven utfylles og sendes rette instans i god tid før datainnsamlingen begynner
nn: Større avvik frå planen takast opp med rettleiar så fort som råd møter førebudd til rettleiingstimane og held rettleiar jamleg orientert om arbeidet med masteroppgåva leverer skriftleg materiale til rettleiar i god tid før kvar rettleiingstime er ansvarleg for at nødvendige søknader vedrørande juridiske/etiske sider ved arbeidet med masteroppgåva utfylles og sendes rette instans i god tid før datainnsamlinga startar

source: Det legges vekt på at teorien skal anvendes på praktiske problemstillinger.
nn: Det blir lagt vekt på at teorien skal nyttast på praktiske problemstillingar.

source: diskutere og vurdere teori- og metodespørsmål i oppgaven
nn: diskutere og vurdere teori- og metodespørsmål i oppgåva

source: Kandidaten har grunnleggende kunnskap om matematikk som fundament for dagens teknologiske samfunn.
nn: Kunnskap har grunnleggjande kunnskap om matematikk som fundament for dagens teknologiske samfunn.

source: Studenten skal fokusere både på egen yrkesidentitet og barnehagens samfunnsmandat og kunne reflektere over dette.
nn: Studenten skal fokusere både på eigen yrkesidentitet og barnehagen sitt samfunnsmandat og kunne reflektere over dette.

source: sentrale religioner og livssyn i Norge og deres betydning for elevene
nn: sentrale religionar og livssyn og deira betydning for elevar

source: De skal videre kunne planlegge og gjennomføre egne prosjekter, jobbe sammen med andre i grupper, kunne formidle fagstoff skriftlig og muntlig og kunne utveksle synspunkter og erfaringer, og slik sett bidra med utvikling av god praksis.
nn: kan planlegge og gjennomføre eigne prosjekt, jobbe saman med andre i grupper, kunne formidle fagstoff skriftleg og munnleg og kunne utveksle synspunkt og erfaringar, og slik sett bidra til utvikling av god praksis

source: Kandidaten har solide regneferdigheter i algebra og det generelle grunnlaget i matematikk til å kunne fortsette på ingeniørutdanning eller integrert master i teknologi.
nn: Kandidaten har solide rekneferdigheiter i algebra og det generelle grunnlaget i matematikk til å kunne fortsette på ingeniørutdanning eller integrert master i teknologi.

source: Det er også obligatorisk å møte opp på eventuell gjennomgang av sikkerhet på laboratoriet.
nn: Det er også obligatorisk å møte opp på gjennomgang av sikkerheit på laboratoriet.

source: FLKI anbefaler kun publisering av oppgaver som ved sensur er vurdert til karakteren C eller bedre.
nn: FLKI tilrår berre publisering av oppgåver som ved sensur er vurdert til karakteren C eller betre.

source: Kandidaten har kunnskap om den teknologiske utviklingen innen kjemiemnene, kjemiingeniørens rolle i samfunnet samt konsekvenser av utvikling og bruk av teknologi.
nn: Kandidaten har kunnskap om den teknologiske utviklinga innan kjemiemna, kjemiingeniøren si rolle i samfunnet samt konsekvensar av utvikling og bruk av teknologi.

source: Har inngående kunnskap om å innhente relevant informasjon og løse problemstillinger ved bruk av grunnlagsfag som matematikk, fysikk, kjemi og metodefag i kombinasjon med nautiske emner som navigasjon, last, sikkerhet og ledelse.
nn: Har inngåande kunnskap om å innhenta relevant informasjon og løysa problemstillingar ved bruk av grunnlagsfag som matematikk, fysikk, kjemi og metodefag i kombinasjon med nautiske emne som navigasjon, last, tryggleik og leiing.

source: Den avsluttende masteroppgaven vil i stor grad bli tilknyttet pågående FoU ¿arbeid ved institusjonen og industrien.
nn: Den avsluttande masteroppgåva vil i stor grad bli knytta til pågående FoU-arbeid ved institusjonen og industrien.

source: kan bidra til et godt samarbeid mellom skole og hjem og sammen med foresatte og faglige instanser identifisere behov hos elevene og iverksette nødvendige tiltak
nn: kan bidra til et godt samarbeid mellom skule og heim og saman med føresette og faglige instansar identifisere behov hos elevane og sette i verk nødvendige tiltak

source: Kandidaten har kunnskap om fysiske tema som er grunnleggende for teknologiske fag.
nn: Kandidaten har kunnskap om fysiske tema som er grunnlegjande for teknologiske fag.

source: har avansert kunnskap som gir en helhetlig forståelse av fagområdet brannsikkerhet
nn: Ha avansert kunnskap som gir ei heilskapleg forståing av fagområdet brannsikkerheit.

source: Hvis studenten trekker seg fra praksis etter denne fristen uten gyldig grunn, har studenten brukt opp ett praksisforsøk i den aktuelle praksisperioden.
nn: Dersom studenten trekker seg frå praksis etter denne fristen utan gyldig grunn, har studenten brukt opp eitt praksisforsøk i den aktuelle praksisperioden.

source: med tydelig forankring i fag, fagdidaktikk og pedagogikk og/eller
nn: med tydeleg forankring i fag, fagdidaktikk og pedagogikk og/eller

source: Har kunnskap om relevante kommunikasjonsformer, spesielt kommunikasjon som fremmer brukermedvirkning og samhandling med pasienter og deres pårørende.
nn: Har kunnskap om relevante kommunikasjonsformer, spesielt kommunikasjon som fremmar brukarmedverknad og samhandling med pasientar og deira pårørande.

source: Kommisjonen skal i fellesskap komme frem til enighet om karakteren.
nn: Kommisjonen skal i fellesskap komme fram til semje om karakteren.

source: I egenvurderingen og vurderingssamtalen utdyper studenten hva en har lært og hva som må være fokus videre for å oppnå læringsutbyttene
nn: I eigenvurderinga og vurderingssamtalen utdjupar studenten kva ein har lært og kva som må være fokus vidare for å oppnå læringsutbyta.

source: Møter krav om progresjon, selvstendighet og ansvar som pedagogisk leder
nn: møter krav om progresjon, sjølvstende og ansvar som pedagogisk leder

source: Som utvekslingsstudent i utlandet får du internasjonal erfaring og møter studenter fra hele verden.
nn: Som utvekslingsstudent i utlandet får du internasjonal erfaring og møter studentar frå heile verda.

source: Oppgaven skal være forankret i reelle problemstillinger fra samfunns- og næringsliv eller forsknings- og utviklingsarbeid og bidra til innføring i vitenskapsteori og metode.
nn: Oppgåva skal vera forankra i reelle problemstillingar frå samfunns- og næringsliv eller forskings- og utviklingsarbeid og bidra til innføring i vitskapsteori og metode.

source: Kandidaten kan kommunisere med andre om realfaglige problemstillinger ved å benytte seg av fysiske begreper og størrelser.
nn: Kandidaten kan kommunisere med andre om realfaglege problemstillingar ved å nytte seg av fysiske begrep og størrelsar.

source: Emnene står i klar relasjon til hverandre og må sees i sammenheng.
nn: Emna står i klar relasjon til kvarandre og må sjåast i samanheng.

source: Emneplanen følger progresjonen i praksis og i de fagovergripende temaene slik det går frem av studieprogramplanen og emneplanen for praksis for det aktuelle året.
nn: Emneplanen følgjer progresjonen i praksis og i dei fagovergripande temaa slik det går fram av studieprogramplanen og emneplanen for praksis for det aktuelle året.

source: Studenter som er fraværende, eller av andre grunner ikke får godkjent obligatorisk laboratoriekurs, vil derfor ikke kunne ta nytt laboratoriekurs inneværende semester.
nn: Studentar som ikkje er til stades, eller av andre grunnar ikkje får godkjend obligatorisk laboratoriekurs, vil difor ikkje kunne ta nytt laboratoriekurs inneverande semester.

source: kan gjennomføre et selvstendig, avgrenset forsknings- eller utviklingsarbeid under veiledning og i tråd med gjeldende forskningsetiske normer
nn: Kan gjennomføra ei sjølvstendig, avgrensa forskings- eller utviklingsarbeid under rettleiing og i tråd med gjeldande forskingsetiske normer.

source: Kandidaten kan bidra til nytenkning, innovasjon, kvalitetsstyring og entreprenørskap ved utvikling og realisering av bærekraftige og samfunnsnyttige produkter, systemer og/eller løsninger.
nn: Kandidaten kan bidra til nytenking, innovasjon, kvalitetsstyring og entreprenørskap ved utvikling og realisering av berekraftige og samfunnsnyttige produkt, systemer og/eller løysingar.

source: Det forventes at studenten tar del i de daglige aktivitetene på avdeling/base, og gjennomfører de oppgavene som er gitt av praksislærer og høgskole.
nn: Det vert forventa at studenten tar del i dei daglege aktivitetane på avdelinga/basen, og gjennomfører dei oppgåvene som er gitt av praksislærar og høgskole.

source: Læring i nødvendig elementær kjemi inngår i fysikkfaget og praktiske forsøk eller laboratoriearbeid tilstrebes.
nn: Læring i nødvendig elementær kjemi inngår i fysikkfaget, og praktiske forsøk eller laboratoriearbeid er sentralt.

source: Kan arbeide sammen med andre på samme nivå om et felles mål.
nn: Kan arbeide saman med andre på same nivå om eit felles mål.

source: Har kjennskap til forsknings- og utviklingsarbeid innenfor disse fagområdene, slik at kandidaten har oppdatert kunnskap om relevante teorier og metoder for disse.
nn: Har kjennskap til forskings- og utvilingsarbeid innanfor desse fagområda, slik at kandidaten har oppdatert kunnskap om relevante teoriar og metodar for desse.

source: lærerutdanning med cand.
nn: lærarutdanning med cand.

source: I emner der det er obligatoriske arbeider (innleveringer eller laboratorieøvinger), må disse være godkjente for at studentene skal få gå opp til eksamen.
nn: I emne der det er obligatoriske arbeid (innleveringar eller laboratorieøvinger), må desse vere godkjente for at studentane skal få gå opp til eksamen.
